; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	image1 - mode
	thermograph3 - mode
	infrared5 - mode
	image4 - mode
	image0 - mode
	thermograph2 - mode
	Star4 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star1 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared5)
	(supports instrument2 image4)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph3)
	(supports instrument4 image4)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image0)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument6 image0)
	(supports instrument6 image4)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star1)
	(supports instrument7 image4)
	(supports instrument7 image1)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument8 image0)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 thermograph3)
	(supports instrument9 infrared5)
	(calibration_target instrument9 Star2)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation5)
	(calibration_target instrument10 Star1)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
	(supports instrument11 infrared5)
	(supports instrument11 image0)
	(supports instrument11 thermograph3)
	(calibration_target instrument11 GroundStation5)
	(calibration_target instrument11 Star2)
	(supports instrument12 infrared5)
	(supports instrument12 thermograph3)
	(calibration_target instrument12 GroundStation3)
	(calibration_target instrument12 GroundStation0)
	(supports instrument13 thermograph2)
	(calibration_target instrument13 Star1)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet11)
)
(:goal (and
	(pointing satellite3 Phenomenon10)
	(pointing satellite4 GroundStation3)
	(have_image Phenomenon6 image4)
	(have_image Phenomenon7 thermograph2)
	(have_image Star8 infrared5)
	(have_image Phenomenon9 thermograph3)
	(have_image Phenomenon9 image0)
	(have_image Phenomenon10 thermograph3)
	(have_image Phenomenon10 image0)
	(have_image Planet11 image4)
	(have_image Planet11 thermograph3)
))

)

; plan
1. (turn_to satellite4 groundstation3 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 groundstation3)
   goals met: 1 of 11
2. (turn_to satellite3 phenomenon10 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 phenomenon10)
   goals met: 2 of 11
3. (turn_to satellite0 groundstation3 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 11
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 11
5. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 2 of 11
6. (turn_to satellite0 planet11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet11)
   goals met: 2 of 11
7. (take_image satellite0 planet11 instrument1 thermograph3)
   added: (have_image planet11 thermograph3)
   goals met: 3 of 11
8. (turn_to satellite0 phenomenon9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 11
9. (take_image satellite0 phenomenon9 instrument1 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 4 of 11
10. (take_image satellite0 phenomenon9 instrument1 image0)
   added: (have_image phenomenon9 image0)
   goals met: 5 of 11
11. (turn_to satellite0 phenomenon7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 11
12. (take_image satellite0 phenomenon7 instrument1 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 6 of 11
13. (turn_to satellite0 phenomenon10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon10)
   goals met: 6 of 11
14. (take_image satellite0 phenomenon10 instrument1 thermograph3)
   added: (have_image phenomenon10 thermograph3)
   goals met: 7 of 11
15. (take_image satellite0 phenomenon10 instrument1 image0)
   added: (have_image phenomenon10 image0)
   goals met: 8 of 11
16. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 8 of 11
17. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 8 of 11
18. (turn_to satellite0 groundstation5 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation5)
   goals met: 8 of 11
19. (calibrate satellite0 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 8 of 11
20. (turn_to satellite0 phenomenon6 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon6)
   goals met: 8 of 11
21. (take_image satellite0 phenomenon6 instrument2 image4)
   added: (have_image phenomenon6 image4)
   goals met: 9 of 11
22. (turn_to satellite0 planet11 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet11)
   goals met: 9 of 11
23. (take_image satellite0 planet11 instrument2 image4)
   added: (have_image planet11 image4)
   goals met: 10 of 11
24. (turn_to satellite0 star8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star8)
   goals met: 10 of 11
25. (take_image satellite0 star8 instrument2 infrared5)
   added: (have_image star8 infrared5)
   goals met: 11 of 11
